Revit 2027 API
Field.CompatibleUnit Method
 Checks if the specified unit is compatible with the field description.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CompatibleUnit(
	ForgeTypeId unitTypeId
)
Public Function CompatibleUnit (
	unitTypeId As ForgeTypeId
) As Boolean
public:
bool CompatibleUnit(
	ForgeTypeId^ unitTypeId
)
member CompatibleUnit :
        unitTypeId : ForgeTypeId -> bool
Parameters
unitTypeId ForgeTypeId
 The unit to check.
Return Value
Boolean
 True if the unit is compatible, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace